#Дано целое число A. Проверить истинность высказывания: «Число A является
#положительным».

A = int(input("Введите число A: ")) # Ввод числа A с клавиатуры
if A > 0:
    print("Число A является положительным")
else:
    print("Число A не является положительным")






